# MinorLayoutPattern Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricSheetType..::..MinorLayoutPattern Property
FabricSheetType Class See Also
---
The layout pattern in the minor direction.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public FabricSheetLayoutPattern MinorLayoutPattern { get; }
```

Visual Basic
---
```text
Public ReadOnly Property MinorLayoutPattern As FabricSheetLayoutPattern
	Get
```

Visual C++
---
```text
public:
property FabricSheetLayoutPattern MinorLayoutPattern {
	FabricSheetLayoutPattern get ();
}
```

# See Also
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace